# IFCHybridImport Properties

---
The IFCHybridImport type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
IFCHybridImport Class
Autodesk.Revit.DB.IFC Namespace